fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияЗаработнойПлаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_УчетОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

//ВКМ - Создание команды на форме и ее размещение (Заполнение табличной части сотрудниками)

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	
	ЭлементПанель = Элементы.НачисленияЗаработнойПлатыКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияЗаработнойПлаты
&НаКлиенте
Процедура НачисленияЗаработнойПлатыВидРасчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	МассивРазрешенных = Новый Массив;
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск"));
	МассивРазрешенных.Добавить(ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом"));
	
	ПараметрОтбора = Новый ПараметрВыбора("Отбор.Ссылка", МассивРазрешенных);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрОтбора);
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры

//ВКМ - Получаем список сотрудников для оклада и для премий, затем указываем графики для окладов
&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	
	Объект.НачисленияЗаработнойПлаты.Очистить();
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК ОбслуживаниеКлиента
		|ПОМЕСТИТЬ ВТ_ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ГОД(ВКМ_ОбслуживаниеКлиента.Дата) = ГОД(&Дата)
		|	И МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(&Дата)
		|	И ВКМ_ОбслуживаниеКлиента.Проведен
		|	И НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ДанныеОтпусков
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	(МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала) = МЕСЯЦ(&Дата)
		|	И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала) = ГОД(&Дата)
		|	ИЛИ МЕСЯЦ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания) = МЕСЯЦ(&Дата)
		|	И ГОД(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания) = ГОД(&Дата))
		|	И ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ДатаНачала, НЕОПРЕДЕЛЕНО) КАК ДатаНачалаОтпуска,
		|	ЕСТЬNULL(ВТ_ДанныеОтпусков.ДатаОкончания, НЕОПРЕДЕЛЕНО) КАК ДатаОкончанияОтпуска,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ПроцентОтРабот.ОбслуживаниеКлиента, 0) <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВыполненныеРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентОтРабот КАК ВТ_ПроцентОтРабот
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВТ_ПроцентОтРабот.Специалист
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеОтпусков КАК ВТ_ДанныеОтпусков
		|		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВТ_ДанныеОтпусков.Сотрудник";
		
		
		Запрос.УстановитьПараметр("Дата", Объект.ПериодРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//Оклад
		СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
		СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
		СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
		СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
		СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
		
		Если Выборка.ВыполненныеРаботы <> 0 Тогда
			СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
			СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияПроцентом;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
			СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
			СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаНачалаОтпуска) Тогда
			
			СтрокаТЧ = Объект.НачисленияЗаработнойПлаты.Добавить();
			СтрокаТЧ.Сотрудник = Выборка.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
			СтрокаТЧ.ГрафикРаботы = Объект.ГрафикРаботы;
			
			Если Месяц(Объект.ПериодРегистрации) = Месяц(Выборка.ДатаНачалаОтпуска) Тогда
				СтрокаТЧ.ДатаНачала = Выборка.ДатаНачалаОтпуска;
			Иначе
				СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.ПериодРегистрации);
			КонецЕсли;
			
			Если Месяц(Объект.ПериодРегистрации) = Месяц(Выборка.ДатаОкончанияОтпуска) Тогда
				СтрокаТЧ.ДатаОкончания = Выборка.ДатаОкончанияОтпуска;
			Иначе
				СтрокаТЧ.ДатаОкончания = КонецМесяца(Объект.ПериодРегистрации);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	


КонецПроцедуры

#КонецОбласти
